// Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда 
// 5 -> Пятница

// Console.WriteLine("Введите номер :");
// string strNum = Console.ReadLine();
// int num = Convert.ToInt32(strNum);

// if(num == 1){
//     Console.WriteLine("Понедельник");
// }
// if(num == 2){
//     Console.WriteLine("Вторник");
// }
// if(num == 3){
//     Console.WriteLine("Среда");
// }
// if(num == 4){
//     Console.WriteLine("четверг");
// }
// if(num == 5){
//     Console.WriteLine("Пятница");
// }
// if(num == 6){
//     Console.WriteLine("Суббота");
// }
// if(num == 7){
//     Console.WriteLine("Воскресенье");
// }
// if (num > 7){Console.WriteLine("такого дня не существует )");}

//  Свитч
//  switch (numberDayOfWeek)
// {
//     case 1: Console.WriteLine("Понедельник"); break; кейсможет быть только один брик в конце 
//     case 2: Console.WriteLine("Вторник"); break;
//     case 3: Console.WriteLine("Среда"); break;
//     case 4: Console.WriteLine("Четверг"); break;
//     case 5: Console.WriteLine("Среда"); break;
//     case 6: Console.WriteLine("Среда"); break;
//     case 7: Console.WriteLine("Среда"); break;
//     default: Console.WriteLine("Введен неправильный номер"); break;
// }

